Table of Contents
 Class LineSegment3D
Namespace
IdeaRS.OpenModel.Geometry3D
Assembly
IdeaRS.OpenModel.dll
Represents a line segment in three-dimensional space.
[OpenModelClass("CI.Geometry3D.LineSegment3D,CI.Geometry3D", "CI.Geometry3D.ILineSegment3D,CI.BasicTypes")]
public class LineSegment3D : Segment3D
Inheritance
object
OpenObject
OpenElementId
Segment3D
LineSegment3D
Inherited Members
 Segment3D.StartPoint
 Segment3D.EndPoint
 Segment3D.LocalCoordinateSystem
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
 Edit this page